Documents/ВнесениеСведенийОЛабораторныхИсследованиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ВнесениеСведенийОЛабораторныхИсследованиях</Name>
			<BasedOn>
				<xr:Item>Document.ПроизводственныеОперации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроизводственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Иммунизация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеСведения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заболевание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаболеванияЖивыхЖивотных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияПрепарата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииПрепаратов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛабораторныеИсследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолученияРезультата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеСведения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МетодыИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерАктаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭкспертизы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияОператор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОрганизацииОператоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательБезопасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиБезопасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательБолезни</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиБолезней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыЛабораторногоИсследования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СвойстваЗаписейСкладскогоЖурнала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнесениеСведенийОЛабораторныхИсследованиях/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Ответственный") Тогда 
		ДополнительныеСвойства.Свойство("Ответственный", Ответственный);
	Иначе
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЕстьПравоОбслуживания = ИнтеграцияВетисAPIСервер.ПроверитьОграниченияПользователя(Организация, Предприятие);
	
	Если НЕ ЕстьПравоОбслуживания Тогда
		Предприятие = Неопределено;
	КонецЕсли;
	
	Иммунизация.Очистить();
	ЛабораторныеИсследования.Очистить();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроизводственныеОперации") Тогда
		
		ЗаполнитьДокументПоДаннымПроизводственнойОперации(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИнтеграцияВетисAPIСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);

	ПроверитьКорректностьЗаполненияТабличнойЧасти(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнтеграцияВетисAPIСервер.УстановитьСтатусПодготовлен(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДокументПоДаннымПроизводственнойОперации(ДанныеЗаполнения)
	
	СтатусДокумента = РегистрыСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций.ТекущийСтатусДокумента(ДанныеЗаполнения);
	
	Если СтатусДокумента <> Справочники.СтатусыЗаявок.УспешноОбработана Тогда
		
		ТекстОшибки = НСтр("ru='Документ %Документ% находится в статусе ""%Статус%"". Ввод на основании разрешен только в статусе ""Заявка успешно обработана"".'");
		
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДанныеЗаполнения);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%"  , СтатусДокумента);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ДокументОснование = ДанныеЗаполнения;
	Организация       = ДанныеЗаполнения.Организация;
	Контрагент        = ДанныеЗаполнения.Контрагент;
	Предприятие       = ДанныеЗаполнения.Предприятие;
	
	ТаблицаПродукции.Загрузить(ДанныеЗаполнения.ТаблицаРезультат.Выгрузить());
	
КонецПроцедуры

Процедура ПроверитьКорректностьЗаполненияТабличнойЧасти(Отказ)
	
	Если ТаблицаПродукции.Количество() > 0 Тогда // таблица продукции должна содержать хотя бы одну запись
		Для Каждого ТекСтрока Из ТаблицаПродукции Цикл
			// Для каждой записи из таблицы продукции должна быть создана запись в таблицах "Лабораторные исследования" или "Иммунизация"
			Если ЛабораторныеИсследования.Найти(ТекСтрока.ЗаписьСкладскогоЖурнала,"ЗаписьСкладскогоЖурнала")=Неопределено
				 И Иммунизация.Найти(ТекСтрока.ЗаписьСкладскогоЖурнала,"ЗаписьСкладскогоЖурнала")=Неопределено Тогда
				ШаблонСообщения = НСтр("ru = 'В таблицах ""Лабораторные исследования"" и ""Иммунизация"" отсутствуют данные для продукции ""%1"" (строка № %2 таблицы продукции).'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаПродукции", ТекСтрока.НомерСтроки,"ЗаписьСкладскогоЖурнала");
				ШаблонСообщения = СтрШаблон(
					ШаблонСообщения,
					ТекСтрока.ЗаписьСкладскогоЖурнала.ПолноеНаименование(),
					ТекСтрока.НомерСтроки);
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ШаблонСообщения,
					ЭтотОбъект,
					Поле,
					,
					Отказ);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнена таблица продукции'"),
			ЭтотОбъект,
			"ТаблицаПродукции",
			,
			Отказ);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ЛабораторныеИсследования Цикл
		
		Если ТекСтрока.РезультатИсследования = Справочники.РезультатыЛабораторногоИсследования.ОтрицательныйРезультат
			ИЛИ ТекСтрока.РезультатИсследования = Справочники.РезультатыЛабораторногоИсследования.ПоложительныйРезультат
			ИЛИ ТекСтрока.РезультатИсследования = Справочники.РезультатыЛабораторногоИсследования.РезультатНевозможноОпределить Тогда
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ДатаПолученияРезультата) Тогда
				ШаблонСообщения = НСтр("ru = 'Не заполнена колонка ""Дата получения результата"" в строке %1 списка ""Лабораторные исследования""!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон(ШаблонСообщения, ТекСтрока.НомерСтроки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЛабораторныеИсследования", ТекСтрока.НомерСтроки, "ДатаПолученияРезультата"),
					,
					Отказ);
				
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(ТекСтрока.Заключение) Тогда
				ШаблонСообщения = НСтр("ru = 'Не заполнена колонка ""Заключение"" в строке %1 списка ""Лабораторные исследования""!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон(ШаблонСообщения, ТекСтрока.НомерСтроки),
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЛабораторныеИсследования", ТекСтрока.НомерСтроки, "Заключение"),
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
